mowglinext/mowglinext/firmware/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
/* Forward declarations */
static void update_blade_led(void);

/* ---------------------------------------------------------------------------
 * COBS packet handlers (Host -> Firmware)
 * ---------------------------------------------------------------------------*/

static void on_heartbeat(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_heartbeat_t) - 2u) {
    return;
  }

  const pkt_heartbeat_t *pkt = (const pkt_heartbeat_t *)data;

  last_heartbeat_tick = HAL_GetTick();

  /* Comms restored. If the active emergency was a PURE comms-loss watchdog latch
   * (no physical trigger) and no sensor is asserted now, auto-clear it so a brief
   * host/USB stall doesn't strand the robot until a manual reset. A physical
   * trigger that appeared in the meantime asserts a sensor (handled below) and
   * clears heartbeat_only_latch, so this never auto-clears a physical e-stop. */
  if (heartbeat_only_latch && Emergency_State()) {
    if (!any_physical_emergency()) {
      Emergency_SetState(0);
      heartbeat_only_latch = false;
      debug_printf("heartbeat resumed: comms-loss emergency auto-cleared\r\n");
    } else {
      /* A physical sensor is now asserted — this is no longer a pure comms
       * latch; require an explicit operator release. */
      heartbeat_only_latch = false;
    }
  }

  if (pkt->emergency_requested) {
    heartbeat_only_latch = false;  /* host-commanded e-stop is not comms-loss */
    Emergency_SetState(1);
  }
  if (pkt->emergency_release_requested) {
    /* Only clear emergency if no physical sensor is still asserted.
     * Firmware is the sole safety authority — never bypass hardware. */
    if (!any_physical_emergency()) {
      Emergency_SetState(0);
      heartbeat_only_latch = false;
    } else {
      debug_printf(
          "emergency release rejected: physical sensor still active\r\n");
    }
  }
}

static void on_cmd_vel(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_cmd_vel_t) - 2u) {
    return;
  }

  const pkt_cmd_vel_t *pkt = (const pkt_cmd_vel_t *)data;

  last_cmd_vel_tick = HAL_GetTick();

  if (main_eOpenmowerStatus == OPENMOWER_STATUS_IDLE) {
    return;
  }

  const float vx = pkt->linear_x;
  const float wz = pkt->angular_z;

  /* Differential-drive inverse kinematics — per-wheel linear speed. */
  float left_mps = vx - wz * WHEEL_BASE * 0.5f;
  float right_mps = vx + wz * WHEEL_BASE * 0.5f;

  if (left_mps > MAX_MPS)
    left_mps = MAX_MPS;
  if (left_mps < -MAX_MPS)
    left_mps = -MAX_MPS;
  if (right_mps > MAX_MPS)
    right_mps = MAX_MPS;
  if (right_mps < -MAX_MPS)
    right_mps = -MAX_MPS;

  /* Hand the target wheel velocities to the PI loop in motors_handler.
   * The mapping to PWM (feedforward + closed-loop correction) lives
   * there now so the integrator can bridge the static-friction
   * deadband on sub-deadband commands. */
  left_target_mps = left_mps;
  right_target_mps = right_mps;
}

static void on_set_drive_pid(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_set_drive_pid_t) - 2u) {
    return;
  }

  const pkt_set_drive_pid_t *pkt = (const pkt_set_drive_pid_t *)data;

  /* Drive behaviour is safety-relevant: reject the whole packet if any field
   * is non-finite, then clamp each field to a safe range before applying so a
   * bad host value can never make the wheel loop diverge. Both wheels share
   * the gains; the output limit stays fixed at 255 PWM (motor controller max).
   * pid_constrain() comes from pid.hpp. */
  if (!std::isfinite(pkt->ticks_per_meter) || !std::isfinite(pkt->kp) ||
      !std::isfinite(pkt->ki) || !std::isfinite(pkt->kd) ||
      !std::isfinite(pkt->integral_limit) || !std::isfinite(pkt->pwm_per_mps)) {
    debug_printf("set_drive_pid rejected: non-finite field\r\n");
    return;
  }

  const float ticks_per_meter =
      pid_constrain(pkt->ticks_per_meter, 50.0f, 5000.0f);
  const float kp = pid_constrain(pkt->kp, 0.0f, 200.0f);
  const float ki = pid_constrain(pkt->ki, 0.0f, 20000.0f);
  const float kd = pid_constrain(pkt->kd, 0.0f, 500.0f);
  const float ilim = pid_constrain(pkt->integral_limit, 0.0f, 255.0f);
  const float ff = pid_constrain(pkt->pwm_per_mps, 50.0f, 600.0f);

  /* Apply atomically w.r.t. motors_handler(), which reads these objects in the
   * main loop at 50 Hz: this handler runs in USB RX interrupt context, and a
   * half-applied update (e.g. new gains but the old integral limit) could let
   * the ki integrator wind up unbounded for one cycle. Same __disable_irq
   * guard motors_handler uses for its setpoint snapshot. setOutputLimit is
   * re-asserted here so the ±255 clamp never silently depends on init_ROS
   * having run first (the PX4 PID default-inits _limit_output to 0). */
  __disable_irq();
  left_wheel_pid.setGains(kp, ki, kd);
  left_wheel_pid.setIntegralLimit(ilim);
  left_wheel_pid.setOutputLimit(255.0f);
  right_wheel_pid.setGains(kp, ki, kd);
  right_wheel_pid.setIntegralLimit(ilim);
  right_wheel_pid.setOutputLimit(255.0f);
  DRIVEMOTOR_SetTicksPerMeter(ticks_per_meter);
  g_pwm_per_mps = ff;
  __enable_irq();

  /* Do not log successful drive-PID updates here: this handler runs in the USB
   * RX path and hardware_bridge intentionally re-sends the packet in bursts
   * after reconnect. Printing each success over the debug UART can stall long
   * enough to starve the main loop and re-trigger the watchdog reboot loop. */
}

static void on_hl_state(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_hl_state_t) - 2u) {
    return;
  }

  const pkt_hl_state_t *pkt = (const pkt_hl_state_t *)data;

  hl_current_mode = pkt->current_mode;
  hl_gps_quality = pkt->gps_quality;

  // Update panel LEDs based on mode
  if (hl_gps_quality < 90) {
    PANEL_Set_LED(PANEL_LED_LOCK, PANEL_LED_OFF);
  } else {
    PANEL_Set_LED(PANEL_LED_LOCK, PANEL_LED_ON);
  }

  // Map host mode to internal status for motor safety.
  // Constants defined in mowgli_protocol.h — keep in sync with
  // HighLevelStatus.msg.
  switch (hl_current_mode) {
  case HL_MODE_AUTONOMOUS:
    PANEL_Set_LED(PANEL_LED_S1, PANEL_LED_ON);
    PANEL_Set_LED(PANEL_LED_S2, PANEL_LED_OFF);
    main_eOpenmowerStatus = OPENMOWER_STATUS_MOWING;
    break;
  case HL_MODE_RECORDING:
    PANEL_Set_LED(PANEL_LED_S1, PANEL_LED_OFF);
    PANEL_Set_LED(PANEL_LED_S2, PANEL_LED_ON);
    main_eOpenmowerStatus = OPENMOWER_STATUS_RECORD;
    break;
  case HL_MODE_MANUAL_MOWING:
    PANEL_Set_LED(PANEL_LED_S1, PANEL_LED_ON);
    PANEL_Set_LED(PANEL_LED_S2, PANEL_LED_ON);
    main_eOpenmowerStatus = OPENMOWER_STATUS_MOWING;
    break;
  case HL_MODE_NULL:
  case HL_MODE_IDLE:
  default:
    PANEL_Set_LED(PANEL_LED_S1, PANEL_LED_OFF);
    PANEL_Set_LED(PANEL_LED_S2, PANEL_LED_OFF);
    PANEL_Set_LED(PANEL_LED_4H, PANEL_LED_OFF);
    PANEL_Set_LED(PANEL_LED_6H, PANEL_LED_OFF);
    PANEL_Set_LED(PANEL_LED_8H, PANEL_LED_OFF);
    main_eOpenmowerStatus = OPENMOWER_STATUS_IDLE;
    left_target_mps = right_target_mps = 0.0f;
    blade_on_off = target_blade_on_off = 0;
    break;
  }

  update_blade_led();
}

