mowglinext/mowglinext/firmware/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
    // Build status bitmask
    uint8_t status_bits = STATUS_BIT_INITIALIZED | STATUS_BIT_RASPI_POWER;
    if (chargecontrol_is_charging) {
      status_bits |= STATUS_BIT_CHARGING;
    }
    if (RAIN_Sense()) {
      status_bits |= STATUS_BIT_RAIN;
    }
    // Sound and UI availability from panel
    status_bits |= STATUS_BIT_UI_AVAIL;
    status_pkt.status_bitmask = status_bits;

    // USS ranges — fill from ultrasonic sensors
    for (unsigned int i = 0; i < MOWGLI_USS_COUNT; i++) {
      status_pkt.uss_ranges_m[i] = 0.0f;
    }
#if OPTION_ULTRASONIC == 1
    status_pkt.uss_ranges_m[0] =
        (float)(ULTRASONICSENSOR_u32GetLeftDistance()) / 10000.0f;
    status_pkt.uss_ranges_m[1] =
        (float)(ULTRASONICSENSOR_u32GetRightDistance()) / 10000.0f;
#endif

    // Emergency bitmask
    uint8_t emergency_bits = 0u;
    if (Emergency_State()) {
      emergency_bits |= EMERGENCY_BIT_LATCH;
      if (Emergency_StopButtonYellow() || Emergency_StopButtonWhite()) {
        emergency_bits |= EMERGENCY_BIT_STOP;
      }
      if (Emergency_WheelLiftBlue() || Emergency_WheelLiftRed()) {
        emergency_bits |= EMERGENCY_BIT_LIFT;
      }
    }
    status_pkt.emergency_bitmask = emergency_bits;

    // Power
    status_pkt.v_charge = charge_voltage;
    status_pkt.v_system = battery_voltage;
    status_pkt.charging_current = current;
    status_pkt.batt_percentage = 0; // TODO: compute from voltage curve

    pkt_reset_cause_t reset_pkt;
    reset_pkt.type = PKT_ID_RESET_CAUSE;
    reset_pkt.reset_cause = g_boot_reset_cause_code;
    mowgli_comms_send(&reset_pkt, sizeof(reset_pkt));
    mowgli_comms_send_status(&status_pkt);
  }

  // Blade motor status (4 Hz) — only after system has initialized
  if (NBT_handler(&blade_nbt) && last_heartbeat_tick != 0u) {
    pkt_blade_status_t blade_pkt;
    memset(&blade_pkt, 0, sizeof(blade_pkt));
    blade_pkt.type = PKT_ID_BLADE_STATUS;
    blade_pkt.is_active = BLADEMOTOR_bActivated ? 1u : 0u;
    blade_pkt.rpm = BLADEMOTOR_u16RPM;
    blade_pkt.power_watts = BLADEMOTOR_u16Power;
    blade_pkt.temperature = blade_temperature;
    blade_pkt.error_count = BLADEMOTOR_u32Error;
    mowgli_comms_send(&blade_pkt, sizeof(blade_pkt));
  }
}

/* ---------------------------------------------------------------------------
 * spinOnce — no-op (rosserial spin removed)
 * ---------------------------------------------------------------------------*/
extern "C" void spinOnce() {
  // Nothing to do — COBS RX is handled in CDC_DataReceivedHandler().
  // This function is kept so main.c doesn't need modification.
}

/* ---------------------------------------------------------------------------
 * Initialisation (replaces init_ROS)
 * ---------------------------------------------------------------------------*/
extern "C" void init_ROS() {
  // Initialise COBS comms layer
  mowgli_comms_init();

  // Register handlers for Host -> Firmware packets
  mowgli_comms_register_handler(PKT_ID_HEARTBEAT, on_heartbeat);
  mowgli_comms_register_handler(PKT_ID_CMD_VEL, on_cmd_vel);
  mowgli_comms_register_handler(PKT_ID_HL_STATE, on_hl_state);
  mowgli_comms_register_handler(PKT_ID_CMD_BLADE, on_cmd_blade);
  mowgli_comms_register_handler(PKT_ID_REBOOT, on_reboot);
  mowgli_comms_register_handler(PKT_ID_SET_DRIVE_PID, on_set_drive_pid);
  mowgli_comms_register_handler(PKT_ID_CONFIG_REQ, on_config_req);

  // Initialise timers
  NBT_init(&led_nbt, LED_NBT_TIME_MS);
  NBT_init(&panel_nbt, PANEL_NBT_TIME_MS);
  NBT_init(&status_nbt, STATUS_NBT_TIME_MS);
  NBT_init(&imu_nbt, IMU_NBT_TIME_MS);
  NBT_init(&motors_nbt, MOTORS_NBT_TIME_MS);
  NBT_init(&blade_nbt, BLADE_NBT_TIME_MS);

#if USE_WHEEL_PI
  // Per-wheel velocity PI gains/limits (vendored PX4 PID, pid.hpp). D=0 — no
  // derivative on a velocity loop. Gains/limits are in PWM units, matching the
  // hand-rolled loop they replace (Kp·err + integrator, integral clamp ±100,
  // output clamp ±255). The PID adds derivative-on-measurement (unused at D=0)
  // and conditional-integration anti-windup.
  left_wheel_pid.setGains(WHEEL_PI_KP_PWM_PER_MPS, WHEEL_PI_KI_PWM_PER_MPS_S,
                          0.0f);
  left_wheel_pid.setIntegralLimit(WHEEL_PI_INT_MAX_PWM);
  left_wheel_pid.setOutputLimit(255.0f);
  right_wheel_pid.setGains(WHEEL_PI_KP_PWM_PER_MPS, WHEEL_PI_KI_PWM_PER_MPS_S,
                           0.0f);
  right_wheel_pid.setIntegralLimit(WHEEL_PI_INT_MAX_PWM);
  right_wheel_pid.setOutputLimit(255.0f);
#endif

  last_odom_tick = HAL_GetTick();
  last_heartbeat_tick = 0;
  last_cmd_vel_tick = 0;
}

float clamp(float d, float min, float max) {
  const float t = d < min ? min : d;
  return t > max ? max : t;
}
